from dataclasses import dataclass


# Данные о тройках вершин и значениях арканов для этих троек
@dataclass
class Triple:
    pos: tuple[int, int, int]
    name: str
    values: tuple[int, int, int] | None = None


""" Кортеж троек вершин полной звезды в которых мы ищем
    определенные комбинации арканов, описанные в кортеже
    triples_combinations (см. ниже)
"""
fullstar_triples: tuple = (
    Triple((1, 2, 3), "Личность"),
    Triple((2, 3, 4), "Духовность"),
    Triple((3, 4, 5), "Деньги"),
    Triple((4, 5, 1), "Отношения"),
    Triple((5, 1, 2), "Здоровье"),
    Triple((6, 7, 8), "Миссия"),
    Triple((1, 15, 9), "Треугольник Личность"),
    Triple((1, 16, 13), "Треугольник Личность"),
    Triple((13, 9, 14), "Треугольник Личность"),
    Triple((2, 18, 10), "Треугольник Духовность"),
    Triple((2, 19, 9), "Треугольник Духовность"),
    Triple((9, 10, 17), "Треугольник Духовность"),
    Triple((3, 21, 11), "Треугольник Деньги"),
    Triple((3, 22, 10), "Треугольник Деньги"),
    Triple((10, 11, 20), "Треугольник Деньги"),
    Triple((4, 24, 12), "Треугольник Отношения"),
    Triple((4, 25, 11), "Треугольник Отношения"),
    Triple((11, 12, 23), "Треугольник Отношения"),
    Triple((5, 27, 13), "Треугольник Здоровье"),
    Triple((5, 28, 12), "Треугольник Здоровье"),
    Triple((12, 13, 26), "Треугольник Здоровье"),
    Triple((1, 9, 2), "Внешний треугольник Личность"),
    Triple((2, 10, 3), "Внешний треугольник Духовность"),
    Triple((3, 11, 4), "Внешний треугольник Деньги"),
    Triple((4, 12, 5), "Внешний треугольник Отношения"),
    Triple((5, 13, 1), "Внешний треугольник Здоровье"),
    Triple((14, 17, 20), "Вершины внутренних треугольников"),
    Triple((17, 20, 23), "Вершины внутренних треугольников"),
    Triple((20, 23, 26), "Вершины внутренних треугольников"),
    Triple((23, 26, 14), "Вершины внутренних треугольников"),
    Triple((26, 14, 17), "Вершины внутренних треугольников"),
)


""" Словарь пронумерованных арканов полной звезды
    Нумерация вершин полной звезды с названиями арканов
    для поиска комбинаций арканов
"""
fullstar_id = {
    1: "personality",
    2: "spirituality",
    3: "money",
    4: "relationship",
    5: "health",
    6: "mission",
    7: "mission_err",
    8: "mission_all",
    9: "pat_male_line_err",
    10: "mat_male_line_err",
    11: "pat_female_line_err",
    12: "doom_err",
    13: "mat_female_line_err",
    14: "personality_inv_vertex",
    15: "personality_inv_mat_vertex",
    16: "personality_inv_pat_vertex",
    17: "spirituality_inv_vertex",
    18: "spirituality_inv_mat_vertex",
    19: "spirituality_inv_pat_vertex",
    20: "money_inv_vertex",
    21: "money_inv_mat_vertex",
    22: "money_inv_pat_vertex",
    23: "relationship_inv_vertex",
    24: "relationship_inv_mat_vertex",
    25: "relationship_inv_pat_vertex",
    26: "health_inv_vertex",
    27: "health_inv_mat_vertex",
    28: "health_inv_pat_vertex",
}


# Значащие комбинации арканов для поиска среди арканов Полной звезды
triples_combinations: tuple = (
    (18, 6, 6),
    (18, 9, 9),
    (18, 11, 11),
    (12, 17, 5),
    (15, 5, 8),
    (15, 20, 5),
    (18, 3, 12),
    (18, 20, 2),
    (9, 15, 6),
    (6, 17, 11),
    (12, 9, 7),
    (7, 19, 12),
    (9, 12, 3),
    (3, 22, 19),
    (21, 4, 10),
    (12, 6, 4),
    (21, 10, 16),
    (21, 10, 7),
    (6, 11, 5),
    (6, 8, 20),
    (3, 7, 22),
    (9, 3, 21),
    (6, 5, 17),
    (21, 7, 13),
    (15, 8, 11),
    (18, 16, 5),
    (6, 20, 14),
    (6, 14, 8),
    (3, 13, 10),
    (5, 14, 19),
    (10, 20, 10),
    (6, 5),
    (9, 6, 15),
    (9, 20, 11),
    (2, 4, 2),
    (10, 15, 5),
    (5, 10, 15),
    (15, 21, 6),
    (8, 13, 5),
    (17, 5, 6),
    (3, 3, 6),
    (18, 5, 5),
    (18, 7, 7),
    (18, 8, 8),
    (19, 7),
    (19, 7, 10),
    (18, 10, 10),
    (18, 11, 11),
    (20, 3, 10),
    (13, 7, 20),
    (13, 21, 8),
    (3, 6, 9),
    (11, 4, 16),
    (2, 8, 6),
)
